{
"blogs":[
 {
      "Id":"01",
      "Name":"Concept of Price Action",
      "Text1":"Introduction to Price action",
      "bold1":"bold",
      "bold2":"",
      "Para1":"Price action refers to study of historical price movements of securities like stock, commodity & currency trading to forecast future price movements.Price action focuses on analyzing patterns, trends(by plotting trendlines), support and resistance level.\n",
      "Image1":"https://github.com/ritesh143kr/TechnicalAnalysis/assets/127919799/6b399834-ca35-4b95-b218-15fd1d6e1669",
      "Text2":"",
      "bold3":"",
      "bold4":"bold",
      "Para2":"Component of Price action",
      "Text3":"Trend lines:- Trend lines are angled lines drawn on charts connecting price points to show the overall direction (upward or downward) of a security's price movement. They help identify support and resistance levels, potentially indicating future price movements.\n",
      "bold5":"",
      "bold6":"",
      "Para3":"Pattern:- price patterns are candlestick pattern shapes formed by the price movement on a chart. They can suggest possible future price direction based on past behavior, like continuations (price keeps moving the same way) or reversals (price changes direction).\n",
      "Image3":"",
      "Text4":"Support & Resistance level:- support and resistance are price levels on a chart where the price tends to bounce back instead of breaking through.\n",
      "bold7":"",
      "bold8":"",
      "Para4":"Support:- \nA price level where buying interest is likely stronger, potentially preventing the price from falling further. Think of it as a floor for the price.\n",
      "Text5":"Resistance:- \nA price level where selling pressure is likely stronger, potentially stopping the price from rising further. Think of it as a ceiling for the price.\n",
      "bold9":"",
      "bold10":"",
      "Para5":"Market Phase:-A market phase in price action refers to the overall direction or behavior of a security's price over a specific period.Understanding Market phases helps traders identify potential trading opportunities and make informed decisions based on the current market context.",
      "Image5":"",
      "Text6":"",
      "bold11":"",
      "bold12":"",
      "Para6":"Concolusion",
      "Text7":"Price action: Read price movement, gauge market mood, predict trends. Simple, flexible, independent, but requires practice.",
      "bold13":"",
      "bold14":"",
      "Para7":""   
}     
]
}
