{
"blogs":[
 {
      "Id":"01",
      "Name":"Concept of Price Action",
      "Text1":"Introduction to Price action\n",
      "bold1":"bold",
      "bold2":"",
      "Para1":"Price action refers to study of historical price movements of securities like stock, commodity & currency trading to forecast future price movements.Price action focuses on analyzing patterns, trends(by plotting trendlines), support and resistance level.",
      "Image1":"https://github.com/ritesh143kr/TechnicalAnalysis/assets/127919799/6b399834-ca35-4b95-b218-15fd1d6e1669",
      "Text2":"",
      "bold3":"",
      "bold4":"bold",
      "Para2":"Component of Price action\n",
      "Text3":"Trend lines:- Trend lines are angled lines drawn on charts connecting price points to show the overall direction (upward or downward) of a security's price movement. They help identify support and resistance levels, potentially indicating future price movements.\n",
      "bold5":"",
      "bold6":"",
      "Para3":"Pattern:- price patterns are candlestick pattern shapes formed by the price movement on a chart. They can suggest possible future price direction based on past behavior, like continuations (price keeps moving the same way) or reversals (price changes direction).\n",
      "Image3":"",
      "Text4":"Support & Resistance level:- support and resistance are price levels on a chart where the price tends to bounce back instead of breaking through.\n",
      "bold7":"",
      "bold8":"",
      "Para4":"Support \nA price level where buying interest is likely stronger, potentially preventing the price from falling further. Think of it as a floor for the price.\n",
      "Text5":"Resistance \nA price level where selling pressure is likely stronger, potentially stopping the price from rising further. Think of it as a ceiling for the price.\n",
      "bold9":"",
      "bold10":"",
      "Para5":"Market Phase:- A market phase in price action refers to the overall direction or behavior of a security's price over a specific period.Understanding Market phases helps traders identify potential trading opportunities and make informed decisions based on the current market context.",
      "Image5":"",
      "Text6":"",
      "bold11":"",
      "bold12":"bold",
      "Para6":"Concolusion\n",
      "Text7":"Price action: Read price movement, gauge market mood, predict trends. Simple, flexible, independent, but requires practice.",
      "bold13":"",
      "bold14":"",
      "Para7":""   
},
 {
      "Id":"02",
      "Name":"Trend lines & It's type",
      "Text1":"Trendlines",
      "bold1":"bold",
      "bold2":"",
      "Para1":"A trendline is a straight line drawn on a chart that connects multiple data points, typically representing price highs or lows, over a given period. It helps visualize the overall trend in the market and predict future price movements.",
      "Image1":"",
      "Text2":"Purpose-\n1.Identify the direction of the trend (upward, downward, or sideways).\n\n2.Gauge support and resistance levels.\n\n3.Potential price reversals: A break above a resistance line or below a support line might suggest a shift in the trend.\n\n",
      "bold3":"",
      "bold4":"",
      "Para2":"Drawing Trendlines-\n1.You'll typically need at least two or three price points to draw a valid trendline.\n\n2.The line should connect the significant highs (for uptrends) or lows (for downtrends) with a reasonable degree of accuracy.\n\n3.The more times the price touches the trendline without breaking through, the stronger the support or resistance level is considered.\n",
      "Text3":"Types of Trendlines\n",
      "bold5":"bold",
      "bold6":"",
      "Para3":"By Direction\n",
      "Image3":"",
      "Text4":"Upward Trendline: Connects a series of higher swing lows, indicating an overall upward movement in prices. Acts as a support level, suggesting buying opportunities.\nDownward Trendline: Connects a series of lower swing highs, indicating a downtrend. Acts as a resistance level, suggesting price declines.\n",
      "bold7":"",
      "bold8":"",
      "Para4":"Horizontal Trendline: Connects a series of swing highs or lows occurring around a similar price level. Indicates consolidation or lack of a defined trend, but can also identify support and resistance zones.\n",
      "Text5":"",
      "bold9":"",
      "bold10":"",
      "Para5":"By Price Connection\n",
      "Image5":"",
      "Text6":"Standard Trendline: The most common type. Connects lows in an uptrend (support line) and highs in a downtrend (resistance line).",
      "bold11":"",
      "bold12":"",
      "Para6":"",
      "Text7":"Channel Lines: Two trendlines drawn, one connecting highs and another connecting lows, to create a channel. The price is expected to stay within the channel until a breakout occurs.\n\n",
      "bold13":"",
      "bold14":"",
      "Para7":""
     },
 {
      "Id":"03",
      "Name":"Support",
      "Text1":"",
      "bold1":"",
      "bold2":"",
      "Para1":"",
      "Image1":"",
      "Text2":"",
      "bold3":"",
      "bold4":"",
      "Para2":"",
      "Text3":"",
      "bold5":"",
      "bold6":"",
      "Para3":"\n\n\n",
      "Image3":"https://github.com/ritesh143kr/Adapi/assets/127919799/f12048de-dfed-443e-9b1b-f508ce1b30fb",
      "Text4":"",
      "bold7":"",
      "bold8":"",
      "Para4":"",
      "Text5":"",
      "bold9":"",
      "bold10":"",
      "Para5":"",
      "Image5":"",
      "Text6":"",
      "bold11":"",
      "bold12":"",
      "Para6":"",
      "Text7":"",
      "bold13":"",
      "bold14":"",
      "Para7":""
     } 
]
}
