{
     "blogs":[
      {
      "Id":"01",
      "Name":"Hammer Candlestick",
      "Text1":"Features:-",
      "bold1":"bold",
      "bold2":"",
      "Para1":"Forecast: Bullish Reversal\nTrend prior to the pattern: downtrend\nOpposite pattern: Hanging Man Candlestick\n",
      "Image1":"https://github.com/ritesh143kr/Adapi/assets/127919799/cd120df0-8072-462e-882d-8bf7c1064c51",
      "Text2":"\nHammer Candlestick\n",
      "bold3":"bold",
      "bold4":"",
      "Para2":"The hammer candlestick is a pattern that is typically used by traders to identify potential reversals trends in price action. The hammer candlestick is formed when the price opens near its high, falls significantly during the trading session, and then rallies to close near its opening price.\n",
      "Text3":"The hammer candlestick is characterized by a small real body (i.e., the difference between the opening and closing prices)and a long lower shadow (i.e., the difference between the low of the day and the closing price).The upper shadow of the candlestick is typically small or non-existent.and lower shadow should be two times ofreal body for valid hammer candlestick.\n",
      "bold5":"",
      "bold6":"",
      "Para3":"The hammer candlestick is considered a bullish signal when it appears in a downtrend, as it suggests that buyers have entered the market and are pushing prices higher. Traders often look for confirmation of the reversal by watching for follow-through buying in thenext few trading sessions.",
      "Image3":"",
      "Text4":"",
      "bold7":"",
      "bold8":"",
      "Para4":"",
      "Text5":"Trade with Hammer Candlestick.",
      "bold9":"bold",
      "bold10":"",
      "Para5":"",
      "Image5":"https://github.com/ritesh143kr/Adapi/assets/127919799/06b85995-078a-424d-b555-da76d96c8e55",
      "Text6":"\nConfirmation:- If a bullish candlisck after hammer candlestick close above hammer candlestick this is confirmation for trends strength,take decision according to confirmation.\n\nBuy:- If a bullish candlestick close above after hammer candlestick then buy the particular stock or instrument and go for long.\n\nStoploss:- Put a stoploss below hammer candlestick lower shadow.\n\nTarget:-Take profit according to (1-2)% rule or atleast 1:2 ratio risk to reward ratio.\n",
      "bold11":"",
      "bold12":"bold",
      "Para6":"KeyPoints:-\n",
      "Text7":"1. Hammer candlestick can be red or green in color.\n\n2. Lower shadow of Hammer candlestick should be atleast two times of real body.\n\n3. Upper shadow or wick should be very small or not.\n\n4. Hammer candlestick appear on the chart after downtrend at bottom.\n\n5. After hammer candle formation huge chance to be trends reversals.becouse here are bear loose the controls and bull take controls.\n ",
      "bold13":"",
      "bold14":"",
      "Para7":"6. Always focus on risk to reward ratio and it should be atleast 1:2.\n\n7. Always take trades after confirmation.\n\n\n"
     },
     {
      "Id":"02",
      "Name":"Hanging Man Candlestick",
      "Text1":"Features:-",
      "bold1":"bold",
      "bold2":"",
      "Para1":"Forecast: Bearish Reversal\nTrend prior to the pattern: uptrend\nOpposite pattern: Hammer Candlestick\n",
      "Image1":"https://github.com/ritesh143kr/Adapi/assets/127919799/65804cd7-806d-4af1-8055-dff5ef95a3fd",
      "Text2":"\nHanging Man Candlestick\n",
      "bold3":"bold",
      "bold4":"",
      "Para2":"The Hanging Man is a bearish reversal candlestick pattern used in technical analysis, indicating a potential shift from an uptrend to a downtrend. It appears during an existing uptrend\n",
      "Text3":"Essentially, the Hanging Man reflects a scenario where the price initially rises after the open but then faces selling pressure that drives it significantly lower. However, by the end of the trading period, buyers manage to push the price back up to near the opening level, forming a small real body. This struggle between buyers and sellers signifies a potential weakening of the uptrend, suggesting a possible reversal to a downtrend.\n",
      "bold5":"",
      "bold6":"",
      "Para3":"The effectiveness of the Hanging Man pattern can vary depending on the market context and other technical indicators. It's crucial to consider a holistic approach to technical analysis.",
      "Image3":"",
      "Text4":"",
      "bold7":"",
      "bold8":"",
      "Para4":"",
      "Text5":"Trade with Hammer Candlestick.",
      "bold9":"bold",
      "bold10":"",
      "Para5":"",
      "Image5":"https://github.com/ritesh143kr/Adapi/assets/127919799/0bc67169-220f-4a32-804b-1f17e41cb5bc",
      "Text6":"\nConfirmation:- Confirmation is often sought by looking at the following candle's behavior. If the next candle closes below the low of the Hanging Man, it strengthens the bearish signal.\n\nSell:- If a bearish candlestick close below after hanging Man candlestick then sell the particular stock or instrument and go for sort.\n\nStoploss:- Put a stoploss above hanging Man candlestick high..\n\nTarget:-Take profit according to (1-2)% rule or atleast 1:2 ratio risk to reward ratio.\n",
      "bold11":"",
      "bold12":"bold",
      "Para6":"KeyPoints:-\n",
      "Text7":"1. Hanging Man candlestick can be red or green in color.\n\n2. Lower shadow of Hanging Man candlestick should be atleast two times of real body.\n\n3. Upper shadow or wick should be very small or not.\n\n4. Hanging Man candlestick appear on the chart after uptrend at top.\n\n5. After hanging Man candle formation & confirm by other bearish candlestick, huge chance to be trends reversals.becouse here are bull loose the controls and bear take controls.\n ",
      "bold13":"",
      "bold14":"",
      "Para7":"6. Always focus on risk to reward ratio and it should be atleast 1:2.\n\n7. Always take trades after confirmation.\n\n\n"
     },
     {
      "Id":"03",
      "Name":"Inverted Hammer Candlestick",
      "Text1":"Features:-",
      "bold1":"bold",
      "bold2":"",
      "Para1":"Forecast: Bullish Reversal\nTrend prior to the pattern: downtrend\nOpposite pattern: Shooting Star Candlestick\n",
      "Image1":"https://github.com/ritesh143kr/Adapi/assets/127919799/50def37f-1243-4f2b-9915-5b16b6079750",
      "Text2":"\nInverted Hammer Candlestick\n",
      "bold3":"bold",
      "bold4":"",
      "Para2":"An inverted hammer candlestick is a pattern used in technical analysis to predict a potential upward turn in the price of an asset, like a stock or currency. Imagine a hammer turned upside down\n",
      "Text3":"This specific combination suggests a potential reversal from a downtrend to an uptrend. The long upper wick reflects the selling pressure encountered, while the small real body and minimal lower wick suggest buying pressure emerging and pushing the price back.\n",
      "bold5":"",
      "bold6":"",
      "Para3":"Closing of the second candle above the high of the inverted hammer is considered a confirmation. This indicates buying pressure pushing the price higher after the inverted hammer.",
      "Image3":"",
      "Text4":"",
      "bold7":"",
      "bold8":"",
      "Para4":"",
      "Text5":"Trade with Inverted Hammer Candlestick.",
      "bold9":"bold",
      "bold10":"",
      "Para5":"",
      "Image5":"https://github.com/ritesh143kr/Adapi/assets/127919799/aba3c296-5546-44a5-8153-cbb694af422d",
      "Text6":"\nConfirmation:- Confirmation is often sought by looking at the following candle's behavior. If the next candle closes above the high of the Inverted Hammer, it strengthens the bullish signal.\n\nBuy:- If a bullish candlestick close high after Inverted Hammer candlestick then buy the particular stock or instrument and go for long.\n\nStoploss:- Put a stoploss below Inverted hammer candlestick low.\n\nTarget:-Take profit according to (1-2)% rule or atleast 1:2 ratio risk to reward ratio.\n",
      "bold11":"",
      "bold12":"bold",
      "Para6":"KeyPoints:-\n",
      "Text7":"1. Inverted Hammer candlestick can be red or green in color.\n\n2. Upper shadow of Inverted candlestick should be atleast two times of real body.\n\n3. Lower shadow or wick should be very small or not.\n\n4. Inverted candlestick appear on the chart after downtrend at bottom.\n\n5. After Inverted Hammer candle formation & confirm by other bullish candlestick, huge chance to be trends reversals.becouse here are bear loose the controls and bull take controls.\n ",
      "bold13":"",
      "bold14":"",
      "Para7":"6. Always focus on risk to reward ratio and it should be atleast 1:2.\n\n7. Always take trades after confirmation.\n\n\n"
     },
     {
      "Id":"04",
      "Name":"Shooting Star Candlestick",
      "Text1":"Features:-",
      "bold1":"bold",
      "bold2":"",
      "Para1":"Forecast: Bearish Reversal\nTrend prior to the pattern: uptrend\nOpposite pattern: Inverted Hammer Candlestick\n",
      "Image1":"https://github.com/ritesh143kr/Adapi/assets/127919799/fe8f1d7c-d401-4b71-b089-213f1f0fa083",
      "Text2":"\nShooting Star Candlestick Appearance & Formation\n",
      "bold3":"bold",
      "bold4":"",
      "Para2":"Appearance:-\nA shooting star candlestick is a technical analysis pattern used in stock trading to identify potential bearish reversals at the end of an uptrend.\n\nFormation:-\n1.It has a long upper shadow, which is at least twice the length of its real body.\n2.It has a small real body that is near the low of the day.\n3.It has a little to no lower shadow.\n",
      "Text3":"Interpretation\n",
      "bold5":"bold",
      "bold6":"",
      "Para3":"The long upper shadow suggests that the price initially gapped higher at the open but was met by selling pressure, pushing the price back down. The small real body and the lack of a lower shadow indicate that the bulls were unable to regain control and the price closed near the low of the day.\n",
      "Image3":"",
      "Text4":"Significance & Limitations\n",
      "bold7":"bold",
      "bold8":"",
      "Para4":"Significance:-\nA shooting star candlestick pattern is a weak bearish reversal signal, especially if it appears after a strong uptrend. However, it is important to confirm the reversal signal with other technical indicators or price action before making any trading decisions.\n",
      "Text5":"Limitations:-\n1.Shooting stars can be false signals, especially if they are not confirmed by other technical indicators.\n2.They are more reliable when they appear at the resistance levels.\n",
      "bold9":"",
      "bold10":"bold",
      "Para5":"Trade with Shooting Star Candlestick.\n",
      "Image5":"https://github.com/ritesh143kr/Adapi/assets/127919799/c7d41359-fc92-4e1e-b689-ea21fe01c443",
      "Text6":"\nConfirmation:- Confirmation is often sought by looking at the following candle's behavior. If the next candle closes below the low of the Shooting Star, it strengthens the bearish signal.\n\nSell:- If a bearish candlestick close below after Shooting Star candlestick then sell the particular stock or instrument and go for sort.\n\nStoploss:- Put a stoploss above Shooting Star Candlestick high..\n\nTarget:-Take profit according to (1-2)% rule or atleast 1:2 ratio risk to reward ratio.\n",
      "bold11":"",
      "bold12":"bold",
      "Para6":"KeyPoints:-\n",
      "Text7":"1. Shooting Star candlestick can be red or green in color.\n\n2. Upper shadow of Shooting Star candlestick should be atleast two times of real body.\n\n3. Lower shadow or wick should be very small or not.\n\n4. Shooting Star candlestick appear on the chart after uptrend at top.\n\n5. After Shooting Star candle formation & confirm by other bearish candlestick, huge chance to be trends reversals.becouse here are bull loose the controls and bear take controls.\n ",
      "bold13":"",
      "bold14":"",
      "Para7":"6. Always focus on risk to reward ratio and it should be atleast 1:2.\n\n7. Always take trades after confirmation.\n\n\n"
     },
     {
      "Id":"05",
      "Name":"Bullish Harami Candlestick",
      "Text1":"",
      "bold1":"",
      "bold2":"",
      "Para1":"",
      "Image1":"",
      "Text2":"",
      "bold3":"",
      "bold4":"",
      "Para2":"",
      "Text3":"",
      "bold5":"",
      "bold6":"",
      "Para3":"\n\n\n",
      "Image3":"https://github.com/ritesh143kr/Adapi/assets/127919799/f12048de-dfed-443e-9b1b-f508ce1b30fb",
      "Text4":"",
      "bold7":"",
      "bold8":"",
      "Para4":"",
      "Text5":"",
      "bold9":"",
      "bold10":"",
      "Para5":"",
      "Image5":"",
      "Text6":"",
      "bold11":"",
      "bold12":"",
      "Para6":"",
      "Text7":"",
      "bold13":"",
      "bold14":"",
      "Para7":""
     } 
   ]
}
