{
     "blog":[
      {
      "Id":"01",
      "Name":"हैमर कैंडलस्टिक",
      "Text1":"परिचय",
      "bold1":"bold",
      "bold2":"",
      "Para1":"हैमर कैंडलस्टिक पैटर्न ट्रेडर्स द्वारा उपयोग किया जाता है ताकि कीमती गतियों में संभावित बुलिश परिवर्तनों की पहचान की जा सके। यह तब प्रकट होता है जब कीमत अपनी उच्चाई के करीब खुलती है, सत्र के दौरान काफी गिरती है, और बाद में अपनी खुले हुए मूल्य के पास बंद होती है। इससे भावना में परिवर्तन का संकेत मिलता है क्योंकि आरंभिक अवधि के बाद खरीदार उभरते हैं, जिससे खरीदी की गतिविधि में वृद्धि का संकेत मिलता है और संभावित ऊपरी गतिविधि का सुझाव भी होता है।\n",
      "Image1":"https://github.com/ritesh143kr/TechnicalAnalysis/assets/127919799/8b1e16e8-b3e5-4fc1-b565-d50c214ca3ac",
      "Text2":"\nहैमर कैंडलस्टिक",
      "bold3":"bold",
      "bold4":"",
      "Para2":"हैमर कैंडलस्टिक में एक छोटा वास्तविक शरीर (खुले और बंद के बीच का अंतर) और एक लंबी निचली छाया (कम और बंद/खुले के बीच का अंतर) होता है। ऊपरी छाया आमतौर पर छोटी या अनुपस्थित होती है। एक वैध हथौड़े के लिए निचली छाया की लंबाई वास्तविक बॉडी की लंबाई से कम से कम दोगुनी होनी चाहिए।\n",
      "Text3":"हैमर कैंडलस्टिक के साथ व्यापार",
      "bold5":"bold",
      "bold6":"",
      "Para3":"पुष्टि:- अगर हैमर कैंडलस्टिक के बाद एक बुलिश कैंडलस्टिक हो, और यह हैमर कैंडलस्टिक की ऊंचाई से ऊपर बंद होता है, तो यह ट्रेंड की मजबूती के लिए पुष्टि है।\n\nप्रवेश रणनीति\nआग्रही खरीद:- कुछ ट्रेडर हैमर कैंडलस्टिक देखते ही एक लॉन्ग पोजिशन में जा सकते हैं, ताकि उन्हें आगे की गति में लाभ हो सके।\n\nसतर्क खरीद:- दूसरों को बुलिश कैंडलस्टिक के बाद का इंतजार करना हो सकता है ताकि ऊपर की दिशा में पुष्टि हो, यह सुनिश्चित करने के लिए कि बुलिश भावना जारी रहने की संभावना है, और फिर वे लॉन्ग जाएं।\n\nस्टॉप-लॉस प्लेसमेंट:- हैमर कैंडलस्टिक की नीचे एक स्टॉप-लॉस आर्डर रखें।\n\nलक्ष्य: लाभ लेने के लिए (1-2)% नियम अनुसार या कम से कम 1:1 या 1:2 अनुपात (रिस्क टू रिवार्ड अनुपात)।\n",
      "Text4":"KeyPoints",
      "bold7":"bold",
      "bold8":"",
      "Para4":"1. हैमर कैंडलस्टिक लाल या हरे रंग का हो सकता है।\n\n2. हैमर कैंडलस्टिक की निचली छाया वास्तविक शरीर से कम से कम दो गुना होनी चाहिए।\n\n3. ऊपरी छाया या विक बहुत छोटी या नहीं होनी चाहिए।\n\n4. हैमर कैंडलस्टिक चार्ट पर डाउनट्रेंड के बाद सबसे नीचे दिखाई देता है।\n\n5. हैमर कैंडल के गठन के बाद, प्रवृत्ति उलटने की बहुत अधिक संभावना होती है, क्योंकि यहां भालू नियंत्रण खो देते हैं और सांड नियंत्रण में आ जाते हैं।\n",
      "Text5":"6. हमेशा जोखिम-प्रतिफल अनुपात पर ध्यान केंद्रित करें और यह कम से कम 1:2 होना चाहिए।\n\n7. हमेशा पुष्टि के बाद ही व्यापार करें।\n",
      "bold9":"",
      "bold10":"",
      "Para5":""
     },
     {
      "Id":"02",
      "Name":"हैंगिंग मैन कैंडलस्टिक",
      "Text1":"Introduction",
      "bold1":"bold",
      "bold2":"",
      "Para1":"हैंगिंग मैन कैंडलस्टिक पैटर्न एक अपट्रेंड के अंत में दिखाई देता है, जो संभावित उलटफेर का संकेत देता है। यह तेजी से मंदी की भावना में बदलाव को दर्शाता है: खरीदार सत्र के दौरान कीमत को काफी बढ़ा देते हैं, लेकिन विक्रेता हस्तक्षेप करते हैं और इसे नीचे धकेल देते हैं, जो अक्सर खुले के करीब या नीचे बंद होता है। यह बाजार में उभरती कमजोरी और मंदी की भावना का संकेत देता है।\n",
      "Image1":"https://github.com/ritesh143kr/TechnicalAnalysis/assets/127919799/5b8af707-b168-4c44-989e-b4e7e8734ef3",
      "Text2":"\nहैंगिंग मैन कैंडलस्टिक",
      "bold3":"bold",
      "bold4":"",
      "Para2":"हैंगिंग मैन कैंडलस्टिक में एक छोटे शरीर वाली कैंडलस्टिक होती है (जो बुलिश या बियरिश हो सकती है), जो कीमती सीमा के निकट होती है। इसकी लंबी निचली छाया (विक) शरीर की लंबाई के कम से कम दोगुनी होती है और कैंडलस्टिक की ऊपरी छाया सामान्यत: छोटी या अस्तित्व में नहीं होती है, जो एक मान्य हैंगिंग मैन कैंडलस्टिक के लिए आवश्यक है।\n",
      "Text3":"Trade with Hammer Candlestick",
      "bold5":"bold",
      "bold6":"",
      "Para3":"पुष्टि:- यदि एक हैंगिंग मैन कैंडलस्टिक के बाद एक बुलिश कैंडलस्टिक है और यह हैंगिंग मैन कैंडलस्टिक के निचले स्तर से बंद होता है,तो यह यह निर्देश की शक्ति की पुष्टि करता है|\n\nप्रवेश रणनीति\nआग्रही खरीद:- कुछ ट्रेडर हैंगिंग मैन कैंडलस्टिक को देखते ही एक छोटी सी पद में प्रवेश कर सकते हैं, ताकि आगे की ओर मोज़म्बिकता हो सके।\n\nसतर्क बिक्री:- दूसरे लोग आगे के मंदी कैंडलस्टिक का इंतजार कर सकते हैं ताकि उन्हें यह सुनिश्चित हो सके कि बिक्री की भावना जारी है और फिर वे शॉर्ट पर जा सकते हैं।\n\nस्टॉप-लॉस प्लेसमेंट:- हैंगिंग मैन कैंडलस्टिक के ऊपर स्टॉप-लॉस ऑर्डर रखें।\n\nलक्ष्य: (1-2)% नियम के अनुसार लाभ उठाएं या कम से कम 1:1 या 1:2 अनुपात (जोखिम से पुरस्कार अनुपात)।\n",
      "Text4":"KeyPoints",
      "bold7":"bold",
      "bold8":"",
      "Para4":"1. हैंगिंग मैन कैंडलस्टिक लाल या हरी रंग का हो सकता है।\n\n2. हैंगिंग मैन कैंडलस्टिक का निचला छायांकन कम से कम दो गुना होना चाहिए।\n\n3. ऊपरी छायांकन या विक बहुत छोटा होना चाहिए या नहीं होना चाहिए।\n\n4. हैंगिंग मैन कैंडलस्टिक चार्ट पर ऊर्ध्वतिरोह से ऊपर उत्तेजित होने के बाद प्रकट होता है।\n\n5.हैंगिंग मैन कैंडलस्टिक गठन के बाद विपरीत यातायात के विशाल अवसर होते हैं। क्योंकि यहां बैल्स नियंत्रण खो देते हैं और भालू नियंत्रण पकड़ लेते हैं।\n",
      "Text5":"6. हमेशा जोखिम-प्रतिफल अनुपात पर ध्यान केंद्रित करें और यह कम से कम 1:2 होना चाहिए।\n\n7. हमेशा पुष्टि के बाद ही व्यापार करें।\n",
      "bold9":"",
      "bold10":"",
      "Para5":""
     },
     {
      "Id":"03",
      "Name":"इनवर्टेडहैमर कैंडलस्टिक",
      "Text1":"Introduction",
      "bold1":"bold",
      "bold2":"",
      "Para1":"इनवर्टेड हैमर कैंडलस्टिक एक पैटर्न है जो नीचे की ओर संभावित उलटफेर का संकेत देता है। यह डाउनट्रेंड के निचले भाग पर दिखाई देता है। इस पैटर्न से पता चलता है कि जहां कारोबारी अवधि की शुरुआत में विक्रेता हावी रहे, वहीं खरीदारों ने ताकत हासिल की, जिससे समापन से पहले कीमत ऊंची हो गई, जो तेजी से उलटफेर की शुरुआत का संकेत दे सकता है।\n",
      "Image1":"https://github.com/ritesh143kr/TechnicalAnalysis/assets/127919799/b8086343-4ff9-4e93-b967-8fcb0c9c401f",
      "Text2":"\nइनवर्टेड हैमर कैंडलस्टिक",
      "bold3":"bold",
      "bold4":"",
      "Para2":"एक उलटा इनवर्टेड हैमर एक संभावित उलट पैटर्न है जो डाउनट्रेंड में दिखाई देता है। इसमें एक छोटा सा वास्तविक शरीर है जिसकी ऊपरी छाया लंबी है और निचली छाया बहुत कम है या बिल्कुल नहीं है। इससे पता चलता है कि खरीदारी में रुचि उभर रही है लेकिन उलटफेर का संकेत देने के लिए बाद की तेजी वाली कैंडलस्टिक से पुष्टि की आवश्यकता होती है।\n",
      "Text3":"Trade with Inverted Hammer Candlestick",
      "bold5":"bold",
      "bold6":"",
      "Para3":"पुष्टि: - यदि इनवर्टेड हैमर कैंडलस्टिक के बाद एक तेजी वाला कैंडलस्टिक, उल्टे इनवर्टेड हैमरकैंडलस्टिक के ऊपर बंद होता है, तो यह रुझान की ताकत की पुष्टि है, आगे की तेजी के लिए।\n\nप्रवेश रणनीति\nआग्रही खरीद:- कुछ ट्रेडर हैमर कैंडलस्टिक देखते ही एक लॉन्ग पोजिशन में जा सकते हैं, ताकि उन्हें आगे की गति में लाभ हो सके।\n\nसतर्क बिक्री:-अन्य लोग तेजी की पुष्टि के लिए अगली तेजी वाली कैंडलस्टिक का इंतजार कर सकते हैं, जिससे यह सुनिश्चित हो सके कि तेजी की भावना जारी रहने और फिर लंबे समय तक चलने की संभावना है।\n\nस्टॉप-लॉस प्लेसमेंट:- इनवर्टेड हैमर कैंडलस्टिक की निम्नतम कीमत के नीचे एक स्टॉपलॉस रखें।\n\nलक्ष्य: - (1-2)% नियम के अनुसार लाभ लें या कम से कम 1:1 या 1:2 अनुपात जोखिम-इनाम अनुपात के अनुसार लाभ लें।\n",
      "Text4":"KeyPoints",
      "bold7":"bold",
      "bold8":"",
      "Para4":"1.इनवर्टेड हैमर कैंडलस्टिक लाल या हरी रंग में हो सकती है।\n\n2. इनवर्टेड हैमर कैंडलस्टिक की ऊपरी छाया की लंबाई अपने वास्तविक शरीर की कम से कम दो गुना होनी चाहिए।\n\n3. निम्न छाया या लंबी धागा बहुत छोटी होनी चाहिए या न होनी चाहिए।\n\n4. इनवर्टेड हैमर कैंडलस्टिक चार्ट पर डाउनट्रेंड के बाद नीचे दिख सकती है।\n\n5. इनवर्टेड हैमर कैंडलस्टिक के फॉर्मेशन के बाद बड़ी संभावना होती है कि ट्रेंड पलटेगा। क्योंकि यहां पर बेयर्स का नियंत्रण हार जाता है और बुल्स का नियंत्रण होता है।\n",
      "Text5":"6. हमेशा जोखिम-प्रतिफल अनुपात पर ध्यान केंद्रित करें और यह कम से कम 1:2 होना चाहिए।\n\n7. हमेशा पुष्टि के बाद ही व्यापार करें।\n",
      "bold9":"",
      "bold10":"",
      "Para5":""
     },
  ]
}
