{
     "blogs":[
      {
      "Id":"01",
      "Name":"Hammer Candlestick Pattern",
      "Text1":"Features:-",
      "bold1":"bold",
      "bold2":"",
      "Para1":" Forecast: Bullish Reversal\n Trend prior to the pattern: downtrend\n Opposite pattern: Hanging Man Candlestick\n",
      "Image1":"https://github.com/ritesh143kr/Adapi/assets/127919799/86d013a1-4b65-490d-8c1c-35e79975f5f5",
      "Text2":"Hammer Candlestick\n",
      "bold3":"bold",
      "bold4":"",
      "Para2":"The hammer candlestick is a pattern that is typically used by traders to identify potential reversals trends in price action. The hammer candlestick is formed when the price opens near its high, falls significantly during the trading session, and then rallies to close near its opening price.\n",
      "Text3":"The hammer candlestick is characterized by a small real body (i.e., the difference between the opening and closing prices)and a long lower shadow (i.e., the difference between the low of the day and the closing price).The upper shadow of the candlestick is typically small or non-existent.and lower shadow should be two times ofreal body for valid hammer candlestick.\n",
      "bold5":"",
      "bold6":"",
      "Para3":"The hammer candlestick is considered a bullish signal when it appears in a downtrend, as it suggests that buyers have entered the market and are pushing prices higher. Traders often look for confirmation of the reversal by watching for follow-through buying in thenext few trading sessions.\n",
      "Image3":"",
      "Text4":"",
      "bold7":"",
      "bold8":"",
      "Para4":"",
      "Text5":"",
      "bold9":"",
      "bold10":"bold",
      "Para5":"Trade with Hammer Candlestick.",
      "Image5":"https://user-images.githubusercontent.com/127919799/281028646-934b6216-6f07-4e3a-8a6e-b64c6ffc8abf.png",
      "Text6":"Confirmation:- If a bullish candlisck after hammer candlestick close above hammer candlestick this is confirmation for trends strength,take decision according to confirmation.\n Buy:- If a bullish candlestick close above after hammer candlestick then buy the particular stock or instrument and go for long.\n Stoploss:- Put a stoploss below hammer candlestick lower shadow.\n Target:-Take profit according to (1-2)% rule or atleast 1:2 ratio risk to reward ratio",
      "bold11":"",
      "bold12":"bold",
      "Para6":"KeyPoints:-",
      "Text7":"1. Hammer candlestick can be red or green in color.\n 2. Lower shadow of Hammer candlestick should be atleast two times of real body.\n 3. upper shadow or wick should be very small or not.\n 4. Hammer candlestick appear on the chart after downtrend at bottom.\n 5. after hammer candle formation huge chance to be trends reversals.becouse here are bear loose the controls and bull take controls.\n ",
      "bold13":"",
      "bold14":"",
      "Para7":"6. Always focus on risk to reward ratio and it should be atleast 1:2.\n 7. Always take trades after confirmation.\n \n"
     }
   ]
}
